; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v10 ?v6)
             (pred_10 ?v8 ?v1)
             (pred_11 ?v10 ?v1)
             (pred_7 ?v12 ?v10 )
	     (pred_6 ?v10)
             (pred_2 ?v2)
             (pred_9 ?v8)
             (pred_1 ?v1)
             (pred_8 ?v10)
             (pred_4 ?v8)
             (pred_5 ?v10)
             (pred_3 ))



(:action op_1
:parameters (?v4 ?v7 ?v5 ?v11)
:precondition (and (pred_2 ?v4) (pred_2 ?v7) (pred_9 ?v5) (pred_1 ?v11)
          (pred_12 ?v4 ?v7) (pred_10 ?v5 ?v11)
                   (pred_11 ?v7 ?v11) (pred_6 ?v4) 
                   (pred_8 ?v7) (pred_4 ?v5))
:effect (and  (pred_5 ?v7) (not (pred_8 ?v7))))


(:action op_4
:parameters (?v4 ?v9)
:precondition (and (pred_2 ?v4) (pred_2 ?v9)
               (pred_6 ?v4) (pred_12 ?v4 ?v9) (pred_5 ?v9))
:effect (and (pred_6 ?v9) (not (pred_6 ?v4))))

(:action op_3
:parameters (?v4 ?v5)
:precondition (and (pred_2 ?v4) (pred_9 ?v5) 
                  (pred_6 ?v4) (pred_7 ?v5 ?v4) (pred_3 ))
:effect (and (pred_4 ?v5)
   (not (pred_7 ?v5 ?v4)) (not (pred_3 ))))


(:action op_5
:parameters (?v4 ?v13 ?v3)
:precondition (and (pred_2 ?v4) (pred_9 ?v13) (pred_9 ?v3)
                  (pred_6 ?v4) (pred_4 ?v3) (pred_7 ?v13 ?v4))
:effect (and (pred_4 ?v13) (pred_7 ?v3 ?v4)
        (not (pred_4 ?v3)) (not (pred_7 ?v13 ?v4))))

(:action op_2
:parameters (?v4 ?v5)
:precondition (and (pred_2 ?v4) (pred_9 ?v5) 
                  (pred_6 ?v4) (pred_4 ?v5))
:effect (and (pred_3 ) (pred_7 ?v5 ?v4) (not (pred_4 ?v5)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_26 obj_21 obj_07 obj_03 obj_27 obj_24 obj_28 obj_29 obj_20 obj_02 obj_25 obj_05 obj_09 obj_15 obj_22 obj_23 obj_04 obj_17 obj_14 obj_13 obj_16 obj_10 obj_18 obj_08 obj_11
    obj_31 obj_12 obj_30
    obj_06 obj_19 obj_01
    )

    (:init
       (pred_3)

       (pred_2 obj_26)
       (pred_2 obj_21)
       (pred_2 obj_07)
       (pred_2 obj_03)
       (pred_2 obj_27)
       (pred_2 obj_24)
       (pred_2 obj_28)
       (pred_2 obj_29)
       (pred_2 obj_20)
       (pred_2 obj_02)
       (pred_2 obj_25)
       (pred_2 obj_05)
       (pred_2 obj_09)
       (pred_2 obj_15)
       (pred_2 obj_22)
       (pred_2 obj_23)
       (pred_2 obj_04)
       (pred_2 obj_17)
       (pred_2 obj_14)
       (pred_2 obj_13)
       (pred_2 obj_16)
       (pred_2 obj_10)
       (pred_2 obj_18)
       (pred_2 obj_08)
       (pred_2 obj_11)
       (pred_1 obj_31)
       (pred_1 obj_12)
       (pred_1 obj_30)
       (pred_9 obj_06)
       (pred_9 obj_19)
       (pred_9 obj_01)

       (pred_12 obj_26 obj_24)
       (pred_12 obj_26 obj_21)
       (pred_12 obj_21 obj_28)
       (pred_12 obj_21 obj_07)
       (pred_12 obj_21 obj_26)
       (pred_12 obj_07 obj_29)
       (pred_12 obj_07 obj_03)
       (pred_12 obj_07 obj_21)
       (pred_12 obj_03 obj_20)
       (pred_12 obj_03 obj_27)
       (pred_12 obj_03 obj_07)
       (pred_12 obj_27 obj_02)
       (pred_12 obj_27 obj_03)
       (pred_12 obj_24 obj_25)
       (pred_12 obj_24 obj_28)
       (pred_12 obj_24 obj_26)
       (pred_12 obj_28 obj_05)
       (pred_12 obj_28 obj_29)
       (pred_12 obj_28 obj_21)
       (pred_12 obj_28 obj_24)
       (pred_12 obj_29 obj_09)
       (pred_12 obj_29 obj_20)
       (pred_12 obj_29 obj_07)
       (pred_12 obj_29 obj_28)
       (pred_12 obj_20 obj_15)
       (pred_12 obj_20 obj_02)
       (pred_12 obj_20 obj_03)
       (pred_12 obj_20 obj_29)
       (pred_12 obj_02 obj_22)
       (pred_12 obj_02 obj_27)
       (pred_12 obj_02 obj_20)
       (pred_12 obj_25 obj_23)
       (pred_12 obj_25 obj_05)
       (pred_12 obj_25 obj_24)
       (pred_12 obj_05 obj_04)
       (pred_12 obj_05 obj_09)
       (pred_12 obj_05 obj_28)
       (pred_12 obj_05 obj_25)
       (pred_12 obj_09 obj_17)
       (pred_12 obj_09 obj_15)
       (pred_12 obj_09 obj_29)
       (pred_12 obj_09 obj_05)
       (pred_12 obj_15 obj_14)
       (pred_12 obj_15 obj_22)
       (pred_12 obj_15 obj_20)
       (pred_12 obj_15 obj_09)
       (pred_12 obj_22 obj_13)
       (pred_12 obj_22 obj_02)
       (pred_12 obj_22 obj_15)
       (pred_12 obj_23 obj_16)
       (pred_12 obj_23 obj_04)
       (pred_12 obj_23 obj_25)
       (pred_12 obj_04 obj_10)
       (pred_12 obj_04 obj_17)
       (pred_12 obj_04 obj_05)
       (pred_12 obj_04 obj_23)
       (pred_12 obj_17 obj_18)
       (pred_12 obj_17 obj_14)
       (pred_12 obj_17 obj_09)
       (pred_12 obj_17 obj_04)
       (pred_12 obj_14 obj_08)
       (pred_12 obj_14 obj_13)
       (pred_12 obj_14 obj_15)
       (pred_12 obj_14 obj_17)
       (pred_12 obj_13 obj_11)
       (pred_12 obj_13 obj_22)
       (pred_12 obj_13 obj_14)
       (pred_12 obj_16 obj_10)
       (pred_12 obj_16 obj_23)
       (pred_12 obj_10 obj_18)
       (pred_12 obj_10 obj_04)
       (pred_12 obj_10 obj_16)
       (pred_12 obj_18 obj_08)
       (pred_12 obj_18 obj_17)
       (pred_12 obj_18 obj_10)
       (pred_12 obj_08 obj_11)
       (pred_12 obj_08 obj_14)
       (pred_12 obj_08 obj_18)
       (pred_12 obj_11 obj_13)
       (pred_12 obj_11 obj_08)
       (pred_8 obj_04)
       (pred_8 obj_21)
       (pred_8 obj_09)
       (pred_11  obj_04 obj_31)
       (pred_11  obj_21 obj_12)
       (pred_11  obj_09 obj_30)
       (pred_5 obj_26)
       (pred_5 obj_07)
       (pred_5 obj_03)
       (pred_5 obj_27)
       (pred_5 obj_24)
       (pred_5 obj_28)
       (pred_5 obj_29)
       (pred_5 obj_20)
       (pred_5 obj_02)
       (pred_5 obj_25)
       (pred_5 obj_05)
       (pred_5 obj_15)
       (pred_5 obj_22)
       (pred_5 obj_23)
       (pred_5 obj_17)
       (pred_5 obj_14)
       (pred_5 obj_13)
       (pred_5 obj_16)
       (pred_5 obj_10)
       (pred_5 obj_18)
       (pred_5 obj_08)
       (pred_5 obj_11)

       (pred_10  obj_06 obj_31)
       (pred_10  obj_19 obj_12)
       (pred_10  obj_01 obj_30)
       (pred_7 obj_06 obj_22)
       (pred_7 obj_19 obj_10)
       (pred_7 obj_01 obj_17)
       (pred_6 obj_10)
    )

    (:goal (and
       (pred_7 obj_19 obj_28)
    ))
(:constraints
  (always (not (pred_6 obj_23)))
)
)

; plan
1. (op_3 obj_10 obj_19)
   deleted: (pred_7 obj_19 obj_10) (pred_3)
   added: (pred_4 obj_19)
   goals met: 0 of 1
2. (op_4 obj_10 obj_18)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_18)
   goals met: 0 of 1
3. (op_4 obj_18 obj_17)
   deleted: (pred_6 obj_18)
   added: (pred_6 obj_17)
   goals met: 0 of 1
4. (op_4 obj_17 obj_14)
   deleted: (pred_6 obj_17)
   added: (pred_6 obj_14)
   goals met: 0 of 1
5. (op_4 obj_14 obj_15)
   deleted: (pred_6 obj_14)
   added: (pred_6 obj_15)
   goals met: 0 of 1
6. (op_4 obj_15 obj_20)
   deleted: (pred_6 obj_15)
   added: (pred_6 obj_20)
   goals met: 0 of 1
7. (op_4 obj_20 obj_29)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_29)
   goals met: 0 of 1
8. (op_4 obj_29 obj_28)
   deleted: (pred_6 obj_29)
   added: (pred_6 obj_28)
   goals met: 0 of 1
9. (op_2 obj_28 obj_19)
   deleted: (pred_4 obj_19)
   added: (pred_3) (pred_7 obj_19 obj_28)
   goals met: 1 of 1
